In [1]:
import pandas as pd
import requests
import numpy as np
import xlrd
import os
import datetime

In [2]:
df_raw = pd.read_excel('HRD_COMPLETE_CODING_SHEET_WITH_NOTES.xlsx',usecols = [0,7,11])
df_raw.head()

  Country name v3regenddate v3regendtype
0         Peru   09/12/1824            5
1        Peru    04/01/1827           12
2        Peru    01/09/1829            0
3         Peru   24/04/1834           11
4         Peru   23/02/1835            0

In [4]:
df_raw = df_raw.replace(to_replace="E",value="01/01/2021")
df_raw.head()

  Country name v3regenddate v3regendtype
0         Peru   09/12/1824            5
1        Peru    04/01/1827           12
2        Peru    01/09/1829            0
3         Peru   24/04/1834           11
4         Peru   23/02/1835            0

In [5]:
df_raw['v3regenddate']= pd.to_datetime(df_raw['v3regenddate'])
df_raw

             Country name v3regenddate v3regendtype
0                    Peru   1824-09-12            5
1                   Peru    1827-04-01           12
2                   Peru    1829-01-09            0
3                    Peru   1834-04-24           11
4                    Peru   1835-02-23            0
...                   ...          ...          ...
2075  Palestine/West Bank   1950-04-24           10
2076  Palestine/West Bank   1950-12-31          NaN
2077  Palestine/West Bank   1967-06-05          NaN
2078  Palestine/West Bank   2007-06-15            5
2079  Palestine/West Bank   2021-01-01          NaN

[2080 rows x 3 columns]

In [7]:
len(df_raw.v3regenddate.unique())

1740

In [8]:
df_2010 = df_raw[(df_raw['v3regenddate']> "2010-01-01") & (df_raw['v3regenddate']< "2020-07-01")]
df_2010.head()

              Country name v3regenddate v3regendtype
60   Turkey/Ottoman Empire   2017-04-16            2
110     Libya/Tripolitania   2011-08-23            7
214                  Egypt   2011-02-11            8
215                  Egypt   2012-06-24           10
216                  Egypt   2012-12-26           10

In [9]:
len (df_2010.v3regenddate.unique())
#dataframe filetered for the past 10 years

56